app/Controllers/Home.php

SELECT *
FROM `pembayaran`
WHERE `user_id` = '15'
SELECT *
FROM `users`
JOIN `profil` ON `profil`.`user_id` = `users`.`id`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '15'
---
	public function mahasiswa()
	{
		if ($post = $this->pembayaranModel->where('user_id', user_id())->get()->getRow()) {
			$status = $post->status;
			$pdf = $post->pdf_link;
		} else {
			$status = null;
			$pdf = null;
		}

		$data = [
			'uang_masuk' => $this->pembayaranModel->where('status', 'settlement')->selectSum('gross_amount', 'nominal')->get()->getRow(),
			'total_pendaftar' => $this->profilModel->countAllResults(),
			'pendaftar_lulus' => $this->profilModel->join('status_mhs', 'status_mhs.profil_id = profil.id')->countAllResults(),
			'status_bayar' => $status,
			'pdf_link' => $pdf,
			'profil' => $this->userModel->join('profil', 'profil.user_id = users.id')->find(user_id()),