app/Controllers/Pendaftar.php

	public function index()
	{

		$data = [
			'profil' => $this->userModel->join('profil', 'profil.user_id = users.id')->find(user_id()),
			'title_meta' => view('panel/partials/title-meta', ['title' => 'Form Registration']),
			'page_title' => view('panel/partials/page-title', ['title' => 'Form Registration', 'li_1' => 'PMB STKIP NU INDRAMAYU', 'li_2' => 'Form Pendaftaran'])
		];

		if ($status = $this->pembayaranModel->where('user_id', user_id())->get()->getRow()) {
---
SELECT *
FROM `users`
JOIN `profil` ON `profil`.`user_id` = `users`.`id`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '15'
SELECT *
FROM `pembayaran`
WHERE `user_id` = '15'

	public function data()
	{

		$data = [
			'profil' => $this->userModel->join('profil', 'profil.user_id = users.id')->find(user_id()),
			'title_meta' => view('panel/partials/title-meta', ['title' => 'Data Diri']),
			'page_title' => view('panel/partials/page-title', ['title' => 'Data Diri', 'li_1' => 'PMB STKIP NU INDRAMAYU', 'li_2' => 'Data Diri'])
		];
---
SELECT *
FROM `users`
JOIN `profil` ON `profil`.`user_id` = `users`.`id`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '15'