app/Controllers/Pengumuman.php

SELECT *
FROM `users`
JOIN `profil` ON `profil`.`user_id` = `users`.`id`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '15'
---
	public function index()
	{

		$data = [
			'pengumuman' => $this->pengumumanModel->findAll(),
			'profil' => $this->userModel->join('profil', 'profil.user_id = users.id')
				->join('status_mhs', 'status_mhs.profil_id = profil.id', 'LEFT')
				->find(user_id()),